app/controllers/courses_controller.rb

INSERT INTO "courses" ("created_at", "description", "duration", "name", "updated_at") VALUES ('2011-09-17 19:59:00.817089', NULL, NULL, 'Matematica', '2011-09-17 19:59:00.817089')
---
  def create
	@course = Course.new(params[:course])

	if @course.save

SELECT "courses".* FROM "courses" WHERE ("courses"."id" = 7) LIMIT 1
---
  def edit
	@course = Course.find(params[:id])

SELECT "courses".* FROM "courses" WHERE ("courses"."id" = 7) LIMIT 1
UPDATE "courses" SET "description" = 'Descrição do curso. Edição da descrição do Curso.', "updated_at" = '2011-09-17 20:21:45.900892' WHERE ("courses"."id" = 7)
---
  def update
	@course = Course.find(params[:id])

	if @course.update_attributes(params[:course])

SELECT "courses".* FROM "courses" WHERE ("courses"."id" = 5) LIMIT 1
DELETE FROM "courses" WHERE ("courses"."id" = 5)
---
  def destroy
	@course = Course.find(params[:id])
	@course.destroy

SELECT "courses".* FROM "courses" WHERE ("courses"."id" = 1) LIMIT 1
---
  def show
	@course = Course.find(params[:id])