app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
     redirect_to roles_path unless current_user.id == 3
     @users = User.all